#include <iostream>
using namespace std;

int main()
{

    int i, ix, j,
        a[2][3], b[3][4], c[2][4];

    for (i = 0; i < 2; i++)
        for (ix = 0; ix < 3; ix++)
        {
            cout << "enter a number " << i << " - " << ix << ":";
            cin >> a[i][ix];
        }

    for (i = 0; i < 2; i++)
    {
        cout << endl;
        for (ix = 0; ix < 3; ix++)
        {
            cout << a[i][ix] << "  ";
        }
    }

    //-----------------------------------------
    cout << "\n===============================================================\n";
    //-----------------------------------------

    for (i = 0; i < 3; i++)
        for (ix = 0; ix < 4; ix++)
        {
            cout << "enter b number " << i << " - " << ix << ":";
            cin >> b[i][ix];
        }

    for (i = 0; i < 3; i++)
    {
        cout << endl;
        for (ix = 0; ix < 4; ix++)
        {
            cout << b[i][ix] << "  ";
        }
    }
    //-----------------------------------------
    cout << "\n===============================================================";
    //-----------------------------------------

    for (i = 0; i < 2; i++)        //(سطر های ماتریس A)
        for (ix = 0; ix < 4; ix++) //(ستون های ماتریس B)
        {
            c[i][ix] = 0;
            for (j = 0; j < 3; j++) //(ستون های ماتریس A)(سطر های ماتریس B)
                c[i][ix] = c[i][ix] + (a[i][j] * b[j][ix]);
        }

    for (i = 0; i < 2; i++)
    {
        cout << endl;
        for (ix = 0; ix < 4; ix++)
        {
            cout << c[i][ix] << "  ";
        }
    }

    //-----------------------------------------

    return 0;
}
